{
    "projects": [
        {
            "title": "Python Data Visualization Discord Bot",
            "description": "Discord market data visualization bot for the albion online game which achieved the mark of 1 million unique users and 15 thousand servers with access to the bot on discord.",
            "image_path": "images/koynmockup.png",
            "content": "Koyn is a discord market data visualization bot for the albion online game which achieved the mark of 1 million unique users and 15 thousand servers with access to the bot on discord. The main objective with this project was to consume the market data from the Albion Data Project, a open source project done by the albion online community, and create a graph visualization of the variation of prices, for the game items, in the discord and make it a profitable project using a subscription payment gateway (stripe).<br>This project was entirely done by myself using Python, to create the logo i used Canvas, to host the bot and the website i used Google CLoud Platform, for the website i used flask, html and css, to create the discord bot i used the discordpy library, to create the subscription system i used stripe as the payment gateway and for the data visualization i used matplotlib, numpy, pandas, seaborn with the data from the Albion Data Project<br><br>I also used the python translators library to allow the users choose the language in which they want to see the data visualization result and mongodb to store the language preference of which discord server and the data of subscribers to show them on the koyn website.<br>You can check the Koyn website accessing https://koyn.online/ and know more about the koyn discord bot market data visualization project.",
            "tags": "Bot Development, Data Visualization, Discordpy, MatplotLib, Seaborn, Stripe"
        },
        {
            "title": "Product Web Scraper",
            "description": "Product Web Scraper is a Python tool designed to extract product data from three major e-commerce websites: Aliexpress, Amazon, and eBay. This scraper gathers detailed information such as product name, price, and link, saving the data in a CSV file. Additionally, it generates a PNG pie chart visualizing different price groups, facilitating easy price comparisons.",
            "image_path": "images/ProductWebScraper.png",
            "content": "As a data analyst, I am always looking for ways to streamline data collection and make it actionable. That is why I developed the Product Web Scraper, a Python tool that extracts detailed product data from Aliexpress, Amazon, and eBay, providing easy price comparisons and insights into product trends.<br><br>📦 Key Features:<ul><li>Multi-Site Scraping: Collects product name, price, and links from Aliexpress, Amazon, and eBay.</li><li>Currency Conversion: Automatically converts all prices to your preferred currency in real-time using Exchange-API.</li><li>CSV Export: Organizes scraped data into a clean CSV file for further analysis.</li><li>Visual Insights: Generates a PNG pie chart to visualize price distribution across different groups.</li></ul>Whether you’re looking to track price trends, perform competitor analysis, or simply compare products, this tool has you covered !<img src='images/ProductWebScraper2.png' class='modalImage'><br><br><a target='_blank' href='https://github.com/GMDiegoLima/product-web-scraper' style='color: #4575f7; text-decoration: none;'>📂 Click here to check the GitHub Repository</a><br>This tool combines the power of automation with in-depth data analysis, helping you make smarter purchasing decisions or optimize your e-commerce strategies.",
            "tags": "Web Scraper, Data Visualization, MatPlotLib, BeautifulSoup, Playwright, SKLearn"
        },
        {
            "title": "PDF to Text & Document Converter",
            "description": "This Python tool extracts text from images embedded in PDF files and converts them into either new PDF files or DOCX documents. It also supports converting entire PDF documents into DOCX format. Ideal for digitizing image-based text documents, the tool utilizes Tesseract-OCR and offers flexible output options.",
            "image_path": "images/PDFtoText.png",
            "content": "As a data analyst, automating data extraction processes is key. That’s why I’ve developed a new Python tool that allows you to extract text from images embedded in PDF files and save the results as either a new PDF or DOCX document. It's a game-changer for anyone dealing with scanned or image-based PDFs! 📄🔍<br><br>💡 Key Features:<ul><li>Extract text from images within PDFs and save it as a new PDF or DOCX file.</li><li>Convert entire PDFs directly to DOCX format, making them easy to edit and search.</li><li>Ideal for digitizing documents where the text isn't selectable.</li></ul>This tool leverages Tesseract-OCR to handle optical character recognition (OCR) tasks and is perfect for anyone looking to streamline document processing workflows.<br><br><a target='_blank' href='https://github.com/GMDiegoLima/pdf-data-extraction' style='color: #4575f7; text-decoration: none;'>📂 Click here to check the GitHub Repository</a><br>If you're interested in OCR, document processing, or just want to streamline your PDF workflows, check it out and let me know your thoughts!<br>",
            "tags": "Data Scraper, Data Analysis, PyMuPDF, Tesseract OCR, Pillow, Reportlab"
        },
        {
            "title": "Otter Destruction",
            "description": "Otter Destruction is a game that i finished for a gamejam about an otter trying to survive the humans, Its a game about surviving to save your friends.",
            "image_path": "images/OtterDestruction.png",
            "content": "A few months ago, I had the incredible opportunity to participate in the Pixel Game Jam 2024, where I developed a pixel art game with the name Otter Destruction using the Godot engine and GDScript. This marked my first game jam as a programmer after previously joining as a 3D artist in many others gamejams, and it was an amazing experience !<br><br>In just 9 days, I dove deep into how the Godot engine work, honing my skills and embracing new challenges.<br><a target='_blank' href='https://github.com/GMDiegoLima/PixelGameJam/tree/main' style='color: #4575f7; text-decoration: none;'>📂 Click here and check out the project files on my github repository</a><br><br><a target='_blank' href='https://3dlima.itch.io/otter-destruction' style='color: #4575f7; text-decoration: none;'>🎮 Click here to play the game on your browser on Itch.io</a><br>The game features Jack, a brave lumberjack otter on a mission to save his friends from a wood industry threat. 🦦⏳ Every second counts, so you must act fast to keep the tree count from reaching zero!<br>I’m thrilled to share this journey with you all and would love your feedback! Let’s connect over our passion for game development and data analysis. 🚀",
            "tags": "Game Development, GameJam, Godot Engine, GDScript, IndieDev"
        }
    ]
}